---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InsertComponentViewFailure
source: html/d5c39244-f4cc-8089-f006-70b32fc4260b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InsertComponentViewFailure Property

This type of Component cannot be placed in Elevation or Section view

## Syntax (C#)
```csharp
public static FailureDefinitionId InsertComponentViewFailure { get; }
```